In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('George.csv')

In [3]:
df.head()

            Name  ID
0    ابانوب اشرف   1
1    ابانوب عادل   2
2    ابانوب فالح   3
3     ابرام صلاح   4
4  ارسانيوس ناجى   5

In [4]:
df.columns

Index(['Name', 'ID'], dtype='object')

In [ ]:
df.columns

In [5]:
df = df.rename(columns={'مسلسل': "ID", "الاسم": "Name"})

In [6]:
df.shape

(285, 2)

In [7]:
df.head()

            Name  ID
0    ابانوب اشرف   1
1    ابانوب عادل   2
2    ابانوب فالح   3
3     ابرام صلاح   4
4  ارسانيوس ناجى   5

In [8]:
df.dropna()

                    Name   ID
0            ابانوب اشرف    1
1            ابانوب عادل    2
2            ابانوب فالح    3
3             ابرام صلاح    4
4          ارسانيوس ناجى    5
..                   ...  ...
280  يوستينا نبيل باسيلى  281
281            يوسف رياض  282
282       يوسف نجاح ناجح  283
283       يؤانا فتاح عطا  284
284           يؤنا مايكل  285

[285 rows x 2 columns]

In [9]:
df.shape

(285, 2)

In [10]:
df["Attended"] = "No"

In [11]:
df

                    Name   ID Attended
0            ابانوب اشرف    1       No
1            ابانوب عادل    2       No
2            ابانوب فالح    3       No
3             ابرام صلاح    4       No
4          ارسانيوس ناجى    5       No
..                   ...  ...      ...
280  يوستينا نبيل باسيلى  281       No
281            يوسف رياض  282       No
282       يوسف نجاح ناجح  283       No
283       يؤانا فتاح عطا  284       No
284           يؤنا مايكل  285       No

[285 rows x 3 columns]

In [12]:
df.to_csv("George_edited.csv")